# Data Project 2021: School performance across Danish municipalities

The aim of the data project is to investigate primary school performance across Danish municipalities based on the grade point average obtained by the students at the final exam. We fetch data for performance of primary schools from the Danish Ministry of Children and Education. Futhermore, we fetch data from Statistics Denmark covering average income levels and shares of hihgly educated inhabitants in the Danish muncipalities. First, we read and clean the data sets in order to merge them into a single DataFrame. Then, we analyze the data and investigate whether there is positive correlation between income and education levels and the performance of primary schools across municipalities. 

**The project is organized as follows:**
1. Data project description
2. Reading and cleaning data 
3. Merging data 
4. Data analysis
6. Conclusion

**Group:** SSTL

**Members:** Louise Otte Arildsen (srb330), Signe Kolind (hmk792), Stine Fürst (qvj635) & Thomas Nielsen (qzw392)

**Imports and set magics:**

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import ipywidgets as widgets
from matplotlib_venn import venn2 # install with pip install matplotlib-venn

import pandas_datareader #!pip install pandas-datareader
import pydst #!pip install git+https://github.com/elben10/pydst

# autoreload modules when code is run
%load_ext autoreload
%autoreload 2

# local modules
import dataproject

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

# Read and clean data

## School performance data

**Reading and cleaning the data**<br>
We read the school data in ``Skoletal.xlsx`` obtained from [education statistics](https://uddannelsesstatistik.dk/Pages/Reports/1834.aspx) conducted by the Danish Ministry of Children and Education. The data set contains key indicators of performance for the primary schools in Denmark at municpality level. 
We clean the data by removing redundant columns and renaming the columns:

In [3]:
# a. load
school = pd.read_excel('Skoletal.xlsx', skiprows=2)

# b. drop columns
drop_these = ['Rækkenavne', 'Overgang 15 mdr ungdomsuddannelse fra 9 og 10 kl', 'Signifikant forskel', 'Forskel', 'Kompetencedækning']
school.drop(drop_these, axis=1, inplace=True)

# c. rename columns
school.rename(columns = {'Institution':'school', 'Skoleår':'year', 'Karaktergennemsnit_skoletal':'gpa', 'Socioøkonomisk reference':'socioeconomic', 'Andel med højest trivsel':'well-being', 'Samlet elevfravær':'absence', 'Elevtal':'students', 'Klassekvotient':'class'}, inplace=True)

The dataset now looks like this:

In [4]:
school.head()
#print(school.tail())

,school,year,gpa,socioeconomic,well-being,absence,students,class
0,Den Classenske Legatskole,2013/2014,8.2,7.8,NaN,NaN,500.0,24.95
1,Den Classenske Legatskole,København,8.2,7.8,NaN,NaN,500.0,24.95
2,Den Classenske Legatskole,2014/2015,7.6,7.5,0.906615,0.089829,521.0,24.90
3,Den Classenske Legatskole,København,7.6,7.5,0.906615,0.089829,521.0,24.90
4,Den Classenske Legatskole,2015/2016,8.2,8.0,0.956044,0.079799,515.0,24.90

**Seperate municipality and school year in column 'Year'**:<br>
In the data set every row is duplicated such that the data is the same in every column except from in column 'Year'. The column 'Year' alternately displays school year and municipality and we want to split this into two seperate columns.

In [5]:
#First we check the numbers of rows in the data set school:
print(f'The number of rows in data set school is = {len(school)}')

#Then we create a new variable 'municipality', which extract allmuncipality names from 'year'
municipality=pd.DataFrame(school['year'].iloc[1::2].values)

#We check that the number of municipality names are equal to half of the row lines. 
print(f'31328 divided by 2 = {len(school)/2}')
print(f'The number of rows in data set municipality is = {len(municipality)}')

#Then we delete every other ro (then ones containing municipalities in the column 'year'
res = [True, False] * 15664
school_new=school[res]
school_new.reset_index(drop=True, inplace=True)
print(f'The number of rows in data set school_new is = {len(school_new)}')

#We then merge school_new with municipalities and arrive at the solution
school_final = pd.concat([school_new, municipality], axis=1)
school_final.tail()
school_final.rename(columns = {school_final.columns[8]:'municipality'}, inplace=True)
school_final.head()

The number of rows in data set school is = 31328
31328 divided by 2 = 15664.0
The number of rows in data set municipality is = 15664
The number of rows in data set school_new is = 15664

,school,year,gpa,socioeconomic,well-being,absence,students,class,municipality
0,Den Classenske Legatskole,2013/2014,8.2,7.8,NaN,NaN,500.0,24.95,København
1,Den Classenske Legatskole,2014/2015,7.6,7.5,0.906615,0.089829,521.0,24.90,København
2,Den Classenske Legatskole,2015/2016,8.2,8.0,0.956044,0.079799,515.0,24.90,København
3,Den Classenske Legatskole,2016/2017,7.8,7.8,0.913669,0.072769,509.0,25.60,København
4,Den Classenske Legatskole,2017/2018,8.8,8.1,0.919540,0.081672,498.0,24.80,København

In [6]:
school_final.tail()

,school,year,gpa,socioeconomic,well-being,absence,students,class,municipality
15659,Vestermarkskolen Aars,2015/2016,NaN,NaN,1.0,0.094875,49.0,NaN,Vesthimmerlands
15660,Vestermarkskolen Aars,2016/2017,NaN,NaN,1.0,0.089781,50.0,NaN,Vesthimmerlands
15661,Vestermarkskolen Aars,2017/2018,NaN,NaN,NaN,NaN,49.0,NaN,Vesthimmerlands
15662,Vestermarkskolen Aars,2018/2019,NaN,NaN,NaN,0.082224,46.0,NaN,Vesthimmerlands
15663,Vestermarkskolen Aars,2019/2020,NaN,NaN,NaN,0.085611,47.0,NaN,Vesthimmerlands

## Income level data

**Reading and cleaning the data**<br>
* Explain where the data is fetched from and how. 
* Briefly explain what the data contains
* Explain how you clean

In [7]:
Dst = pydst.Dst(lang='en') #

In [8]:
Dst.get_subjects()

    id                                       desc  active  hasSubjects
0   02                   Population and elections    True         True
1   04                  Labour, income and wealth    True         True
2   06                     Prices and consumption    True         True
3   05                          Living conditions    True         True
4   14  National accounts and government finances    True         True
5   03                    Education and knowledge    True         True
6   11                           Business sectors    True         True
7   07                 Business sector in general    True         True
8   16                    Money and credit market    True         True
9   13                           External economy    True         True
10  18                Culture and National Church    True         True
11  01          Geography, environment and energy    True         True
12  19                                      Other    True         True

In [9]:
tables = Dst.get_tables(subjects=['04'])
tables
tables[tables.id == 'INDKP101']

,id,text,unit,updated,firstPeriod,latestPeriod,active,variables
194,INDKP101,People,-,2020-11-27 08:00:00,1987,2019,True,"[region, unit, sex, type of income, time]"

In [10]:
indk_var = Dst.get_variables(table_id='INDKP101')
indk_var

indk_var = Dst.get_variables(table_id='INDKP101')
for id in ['OMRÅDE','ENHED','KOEN','INDKOMSTTYPE', 'Tid']:
    print(id)
    values = indk_var.loc[indk_var.id == id,['values']].values[0,0]
    for value in values:      
        print(f' id = {value["id"]}, text = {value["text"]}')

OMRÅDE
 id = 000, text = All Denmark
 id = 01, text = Province Byen København
 id = 101, text = Copenhagen
 id = 147, text = Frederiksberg
 id = 155, text = Dragør
 id = 185, text = Tårnby
 id = 02, text = Province Københavns omegn
 id = 165, text = Albertslund
 id = 151, text = Ballerup
 id = 153, text = Brøndby
 id = 157, text = Gentofte
 id = 159, text = Gladsaxe
 id = 161, text = Glostrup
 id = 163, text = Herlev
 id = 167, text = Hvidovre
 id = 169, text = Høje-Taastrup
 id = 183, text = Ishøj
 id = 173, text = Lyngby-Taarbæk
 id = 175, text = Rødovre
 id = 187, text = Vallensbæk
 id = 03, text = Province Nordsjælland
 id = 201, text = Allerød
 id = 240, text = Egedal
 id = 210, text = Fredensborg
 id = 250, text = Frederikssund
 id = 190, text = Furesø
 id = 270, text = Gribskov
 id = 260, text = Halsnæs
 id = 217, text = Helsingør
 id = 219, text = Hillerød
 id = 223, text = Hørsholm
 id = 230, text = Rudersdal
 id = 04, text = Province Bornholm
 id = 400, text = Bornholm
 id = 05, text = Province Østsjælland
 id = 253, text = Greve
 id = 259, text = Køge
 id = 350, text = Lejre
 id = 265, text = Roskilde
 id = 269, text = Solrød
 id = 06, text = Province Vest- og Sydsjælland
 id = 320, text = Faxe
 id = 376, text = Guldborgsund
 id = 316, text = Holbæk
 id = 326, text = Kalundborg
 id = 360, text = Lolland
 id = 370, text = Næstved
 id = 306, text = Odsherred
 id = 329, text = Ringsted
 id = 330, text = Slagelse
 id = 340, text = Sorø
 id = 336, text = Stevns
 id = 390, text = Vordingborg
 id = 07, text = Province Fyn
 id = 420, text = Assens
 id = 430, text = Faaborg-Midtfyn
 id = 440, text = Kerteminde
 id = 482, text = Langeland
 id = 410, text = Middelfart
 id = 480, text = Nordfyns
 id = 450, text = Nyborg
 id = 461, text = Odense
 id = 479, text = Svendborg
 id = 492, text = Ærø
 id = 08, text = Province Sydjylland
 id = 530, text = Billund
 id = 561, text = Esbjerg
 id = 563, text = Fanø
 id = 607, text = Fredericia
 id = 510, text = Haderslev
 id = 621, text = Kolding
 id = 540, text = Sønderborg
 id = 550, text = Tønder
 id = 573, text = Varde
 id = 575, text = Vejen
 id = 630, text = Vejle
 id = 580, text = Aabenraa
 id = 09, text = Province Østjylland
 id = 710, text = Favrskov
 id = 766, text = Hedensted
 id = 615, text = Horsens
 id = 707, text = Norddjurs
 id = 727, text = Odder
 id = 730, text = Randers
 id = 741, text = Samsø
 id = 740, text = Silkeborg
 id = 746, text = Skanderborg
 id = 706, text = Syddjurs
 id = 751, text = Aarhus
 id = 10, text = Province Vestjylland
 id = 657, text = Herning
 id = 661, text = Holstebro
 id = 756, text = Ikast-Brande
 id = 665, text = Lemvig
 id = 760, text = Ringkøbing-Skjern
 id = 779, text = Skive
 id = 671, text = Struer
 id = 791, text = Viborg
 id = 11, text = Province Nordjylland
 id = 810, text = Brønderslev
 id = 813, text = Frederikshavn
 id = 860, text = Hjørring
 id = 849, text = Jammerbugt
 id = 825, text = Læsø
 id = 846, text = Mariagerfjord
 id = 773, text = Morsø
 id = 840, text = Rebild
 id = 787, text = Thisted
 id = 820, text = Vesthimmerlands
 id = 851, text = Aalborg
ENHED
 id = 101, text = People with type of income (number)
 id = 110, text = Amount of income (DKK 1.000)
 id = 116, text = Average income for all people (DKK)
 id = 121, text = Average income for people with type of income (DKK)
KOEN
 id = MOK, text = Men and women, total
 id = M, text = Men
 id = K, text = Women
INDKOMSTTYPE
 id = 100, text = 1 Disposable income (2+30-31-32-35)
 id = 105, text = 2 Pre-tax Income, total (3+7+22+26+29)
 id = 110, text = 3 Primary income (4+5+6)
 id = 115, text = 4 Wages and salaries etc., total
 id = 120, text = 5 Entrepreneurial income, total
 id = 125, text = 6 Received fees subject to labour market contributions
 id = 130, text = 7 Public transfer incomes(8+14+19)
 id = 135, text = 8 Unemployment and cash benefits (9+10+11+12+13)
 id = 140, text = 9 Unemployment benefits
 id = 145, text = 10 Other benefits from unemployment funds
 id = 150, text = 11 Cash benefits
 id = 155, text = 12 Job training & Limited employment benefits
 id = 160, text = 13 Sickness- & parental leave
 id = 165, text = 14 Other transfers(15+16+17+18)
 id = 170, text = 15 Public educational grants
 id = 175, text = 16 Housing benefits
 id = 180, text = 17 Child benefits
 id = 185, text = 18 Green check
 id = 190, text = 19 Public pensions(20+21)
 id = 195, text = 20 Early retirement pay
 id = 200, text = 21 Disability and old age pensions
 id = 205, text = 22 Private pensions(23+24+25)
 id = 210, text = 23 Public servants pension
 id = 215, text = 24 Pension from the ATP (Labour Market Supplementary Pension Scheme)
 id = 220, text = 25 Labour market and private pensions (Annuities only)
 id = 225, text = 26 Capital income, gross (27+28)
 id = 230, text = 27 Interest received
 id = 235, text = 28 Other property income (From stocks etc.)
 id = 240, text = 29 Other personal income
 id = 245, text = 30 Imputed rent
 id = 250, text = 31 Interest expenses
 id = 255, text = 32 Tax, total (33+34)
 id = 260, text = 33 Income taxes
 id = 265, text = 34 Labour market contributions etc.
 id = 270, text = 35 Paid alimonies
 id = 275, text = Equivalised Disposable income
 id = 280, text = Land tax home owners
 id = 285, text = Land tax, tenants
 id = 290, text = Taxable income
Tid
 id = 1987, text = 1987
 id = 1988, text = 1988
 id = 1989, text = 1989
 id = 1990, text = 1990
 id = 1991, text = 1991
 id = 1992, text = 1992
 id = 1993, text = 1993
 id = 1994, text = 1994
 id = 1995, text = 1995
 id = 1996, text = 1996
 id = 1997, text = 1997
 id = 1998, text = 1998
 id = 1999, text = 1999
 id = 2000, text = 2000
 id = 2001, text = 2001
 id = 2002, text = 2002
 id = 2003, text = 2003
 id = 2004, text = 2004
 id = 2005, text = 2005
 id = 2006, text = 2006
 id = 2007, text = 2007
 id = 2008, text = 2008
 id = 2009, text = 2009
 id = 2010, text = 2010
 id = 2011, text = 2011
 id = 2012, text = 2012
 id = 2013, text = 2013
 id = 2014, text = 2014
 id = 2015, text = 2015
 id = 2016, text = 2016
 id = 2017, text = 2017
 id = 2018, text = 2018
 id = 2019, text = 2019

In [11]:
variables = {'OMRÅDE':['*'],'ENHED':['116'],'KOEN':['MOK'],'INDKOMSTTYPE':['105'], 'Tid':['2013','2014','2015','2016','2017','2018','2019']}
inc_api = Dst.get_data(table_id = 'INDKP101', variables=variables)
display(inc_api)

,OMRÅDE,ENHED,KOEN,INDKOMSTTYPE,TID,INDHOLD
0,Assens,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2013,270534
1,Faaborg-Midtfyn,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2013,267375
2,Kerteminde,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2013,276207
3,Nyborg,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2013,270759
4,Odense,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2013,266297
...,...,...,...,...,...,...
765,Norddjurs,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,294950
766,Thisted,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,306245
767,Kerteminde,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,319218
768,Varde,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,314202
769,Favrskov,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,341952

In [12]:
inc_1=inc_api.drop(['KOEN','INDKOMSTTYPE','ENHED'], axis=1)

inc_1.rename(columns = {'INDHOLD':'avg_income','OMRÅDE':'municipality','TID':'year'}, inplace=True)
display(inc_1)

print(f'Years in dat: {inc_1.year.unique()}')
print(f'Municipalities in dat = {len(inc_1.municipality.unique())}')

              OMRÅDE   TID  INDHOLD
0             Assens  2013   270534
1    Faaborg-Midtfyn  2013   267375
2         Kerteminde  2013   276207
3             Nyborg  2013   270759
4             Odense  2013   266297
..               ...   ...      ...
765        Norddjurs  2019   294950
766          Thisted  2019   306245
767       Kerteminde  2019   319218
768            Varde  2019   314202
769         Favrskov  2019   341952

[770 rows x 3 columns]

        municipality  year  avg_income
0             Assens  2013      270534
1    Faaborg-Midtfyn  2013      267375
2         Kerteminde  2013      276207
3             Nyborg  2013      270759
4             Odense  2013      266297
..               ...   ...         ...
765        Norddjurs  2019      294950
766          Thisted  2019      306245
767       Kerteminde  2019      319218
768            Varde  2019      314202
769         Favrskov  2019      341952

[770 rows x 3 columns]

Years in dat: [2013 2014 2015 2016 2017 2018 2019]
Municipalities in dat = 110

## Education level data

**Reading and cleaning the data**<br>
* Explain where the data is fetched from and how. 
* Briefly explain what the data contains
* Explain how you clean

In [13]:
Louises data

SyntaxError: invalid syntax (<ipython-input-13-d320e25a9b3a>, line 1)

## Explore data set

In order to be able to **explore the raw data**, we here provide an **interactive plot** to show, respectively, the employment and income level in each municipality

The **static plot** is:

In [ ]:
def plot_empl_inc(school,dataset,municipality): 
    
    dataset == 'School'
    df = school_final
    y = 'employment'

    
    I = df['municipality'] == municipality
    ax = df.loc[I,:].plot(x='year', y=y, style='-o')

The **interactive plot** is:

ADD SOMETHING HERE IF THE READER SHOULD KNOW THAT E.G. SOME MUNICIPALITY IS SPECIAL.

# Merge data sets

We now create a data set with **municpalities which are in both of our data sets**. We can illustrate this **merge** as:

In [ ]:
plt.figure(figsize=(15,7))
v = venn2(subsets = (4, 4, 10), set_labels = ('inc', 'empl'))
v.get_label_by_id('100').set_text('dropped')
v.get_label_by_id('010').set_text('dropped' )
v.get_label_by_id('110').set_text('included')
plt.show()

In [ ]:
merged = pd.merge(empl_long, inc_long, how='inner',on=['municipality','year'])

print(f'Number of municipalities = {len(merged.municipality.unique())}')
print(f'Number of years          = {len(merged.year.unique())}')

# Analysis

To get a quick overview of the data, we show some **summary statistics by year**:

In [ ]:
.groupby('year').agg(['mean','std']).round(2)
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

ADD FURTHER ANALYSIS. EXPLAIN THE CODE BRIEFLY AND SUMMARIZE THE RESULTS.

# Conclusion

ADD CONCISE CONLUSION.